[{
  "_id": "730163ae-390d-4412-94f9-24bf4fe090f9",
  "topic_id": "35ada9dc-c24c-480e-bfdd-1d41f00e8559",
  "title": "\nSve što smo saznali o Call of Duty - Black Ops 6 naslovu!\n",
  "featuredImage": "http://localhost:3000/blogs/featured/1719251291910-458661298.jpeg",
  "content": [
    {
      "_id": 0,
      "key": "text",
      "value": [
        "Call of Duty: Black Ops 6 naslov donosi novu dimenziju u popularnom FPS serijalu, vraćajući se sa još jednom uzbudljivom avanturom smeštenom u devedesete godine prošlog veka. Nakon uspeha igre Black Ops Cold War iz 2020. godine, nova igra donosi osveženje i inovacije koje će sigurno obradovati dugogodišnje fanove, ali i privući nove igrače. U nastavku ćemo istražiti sve novine koje donosi Black Ops 6, uključujući kampanju, multiplayer i omiljeni Zombies mod."
      ]
    },
    {
      "_id": 1,
      "key": "image",
      "value": [
        "http://localhost:3000/blogs/singles/1719251291923-625547629.jpeg"
      ]
    },
    {
      "_id": 2,
      "key": "heading",
      "value": [
        "O cemu se radi?"
      ]
    },
    {
      "_id": 3,
      "key": "text",
      "value": [
        "Call of Duty: Black Ops 6 naslov izlazi 25. oktobra 2024. godine, zadržavajući tradicionalni jesenji termin lansiranja. Igra će biti dostupna na Xbox Series X/S, Xbox One, PlayStation 5, PlayStation 4 i PC, što znači da će svi igrači, bez obzira na platformu, moći da uživaju u novim avanturama. Kampanja Black Ops 6 nas vraća u 1990-e godine, istražujući period globalne nestabilnosti nakon Hladnog rata. Priča prati protagoniste koji se suočavaju sa unutrašnjom pretnjom, zbog koje postaju odmetnici kako bi se izborili sa misterioznom silom koja infiltrira američku vladu. Radnja se odvija neposredno nakon događaja iz Black Ops 2, sa globalnim događajima poput Zalivskog rata koji igraju ključnu ulogu. Jedan od najuzbudljivijih elemenata kampanje je povratak omiljenih likova, kao što je Frank Woods, koji se udružuje sa novim likovima poput Troy Marshall-a, Felix Neumann-a i Sevati Duma-s. CIA agent Russell Adler, poznat iz Black Ops Cold War, takođe se vraća sa misterioznim motivima. Misije variraju od velikih sukoba Zalivskog rata do ciljanih operacija koje zahtevaju tihu infiltraciju, pružajući igračima raznolika i uzbudljiva iskustva."
      ]
    },
    {
      "_id": 4,
      "key": "gallery",
      "value": [
        "http://localhost:3000/blogs/galleries/1719251291945-835424799.jpeg",
        "http://localhost:3000/blogs/galleries/1719251291945-998921451.webp",
        "http://localhost:3000/blogs/galleries/1719251291946-353270344.webp"
      ]
    },
    {
      "_id": 5,
      "key": "heading",
      "value": [
        "Da li mozemo da ocekujemo iznenadjenja?"
      ]
    },
    {
      "_id": 6,
      "key": "text",
      "value": [
        "Black Ops 6 donosi 16 novih multiplayer mapa, uključujući 12 Core 6v6 mapa i 4 manje Strike mape za 2v2 ili Face Off verzije 6v6 borbi. Povratak klasičnog Prestige sistema omogućava igračima da napreduju kroz nivoe bez sezonskih ograničenja, što će svakako obradovati veterane serijala. Jedna od najznačajnijih novina u multiplayer-u je sistem Omnimovement, koji omogućava sprints, slajdove i zaranjanja u bilo kom pravcu, pružajući veću mobilnost i fleksibilnost u borbi. Ovaj sistem je podržan Intelligent Movement funkcijom, koja nudi opcionalne asistencije za kontrolisanje sprinta, penjanja i čučanja, čineći igru pristupačnijom i dinamičnijom. Zombies mod u Black Ops 6 donosi povratak omiljenog Round-Based sistema, sa dve nove mape: Terminus i Liberty Falls. Ove mape nastavljaju narativ iz Black Ops Cold War, pružajući timovima priliku da se bore protiv hordi zombija uz kooperativni multiplayer pristup. U igru se vraćaju likovi poput Grigori Weavera, Elizabeth Grey i Mac Carvera. Zombies mod je poznat po raznim power-upovima i skrivenim iznenađenjima, poznatim kao Easter Eggs, koji dodatno održavaju interesovanje igrača i čine svaku sesiju jedinstvenom. Ovaj mod takođe omogućava korišćenje drugih operatera, iako oni neće imati specifične dijaloge i kinematike kao posvećeni likovi. Call of Duty: Black Ops 6 obećava da će biti jedno od najupečatljivijih izdanja u serijalu, donoseći inovacije i povratak klasičnim elementima koji su učinili ovaj serijal popularnim. Sa intrigantnim narativom, bogatim multiplayer opcijama i povratkom voljenog Zombies moda, Black Ops 6 ima sve što je potrebno da zadovolji fanove i postavi nove standarde za buduće igre. Omnimovement sistem i povratak Prestige sistema samo su neke od mnogih razloga za uzbuđenje, a mi jedva čekamo da vidimo kako će igra izgledati u punom sjaju kada izađe u oktobru."
      ]
    },
    {
      "_id": 7,
      "key": "gallery",
      "value": [
        "http://localhost:3000/blogs/galleries/1719251291954-154263200.webp",
        "http://localhost:3000/blogs/galleries/1719251291955-568616143.webp",
        "http://localhost:3000/blogs/galleries/1719251291957-209134401.webp"
      ]
    },
    {
      "_id": 8,
      "key": "image",
      "value": [
        "http://localhost:3000/blogs/singles/1719251291930-324224058.jpeg"
      ]
    },
    {
      "_id": 9,
      "key": "gallery",
      "value": [
        "http://localhost:3000/blogs/galleries/1719251291959-255928385.jpeg",
        "http://localhost:3000/blogs/galleries/1719251291963-934658719.jpeg",
        "http://localhost:3000/blogs/galleries/1719251291966-423827739.jpeg"
      ]
    }
  ],
  "published": false
},
{
  "_id": "6ba12b9d-def7-4234-831e-ba476a1b1559",
  "topic_id": "f27cf95d-54c2-4771-8daf-455800601d54",
  "title": "Why i like this movie?",
  "featuredImage": "http://localhost:3000/blogs/featured/1719255174378-874183698.jpeg",
  "content": [
    {
      "_id": 0,
      "key": "text",
      "value": [
        "This is the reason why i like it"
      ]
    },
    {
      "_id": 1,
      "key": "heading",
      "value": [
        "Because its fun, that's why..."
      ]
    },
    {
      "_id": 2,
      "key": "text",
      "value": [
        "I also love avenged sevenfold."
      ]
    }
  ],
  "published": false
},
{
  "_id": "672fe5de-ee00-48d8-a8c4-99618b9e4fb0",
  "topic_id": "a2b295c5-7aa4-4009-b55a-7de99be1dd81",
  "title": "This is an awesome title",
  "featuredImage": "http://localhost:3000/blogs/featured/1719255746847-394019438.jpeg",
  "content": [
    {
      "_id": 0,
      "key": "heading",
      "value": [
        "Why do i like this band?"
      ]
    },
    {
      "_id": 1,
      "key": "text",
      "value": [
        "Na čelu sa producentskim timom koji su činili Andrej Murdok i Fred Arkambault, Sevenfold su snimili album koji se nije plašio da oda počast korenima, ali da u isto vreme bude nešto posebno i jedinstveno. Kako je Šedouz tada izjavio: „Znali smo od samog početka da ako ljudi nemaju jako mišljenje o nama nikada nećemo biti ništa specijalno, a ako nas obasipaju ljubavlju ili mržnjom znači da imamo nešto posebno. Većinu najvećih bendova na svetu ili volite ili mrzite, a mi nismo želeli da budemo izuzetak tog pravila. Čak i da kada neko dođe posle nastupa i kaže ‘to je bilo jebeno sranje! Šta kog đavola mislite da radite?!’ bio bih srećan, zato što smo u njemu izazvali reakciju i pamtiće nas zauvek.“"
      ]
    },
    {
      "_id": 2,
      "key": "image",
      "value": [
        "http://localhost:3000/blogs/singles/1719255746873-617862205.jpeg"
      ]
    },
    {
      "_id": 3,
      "key": "text",
      "value": [
        "Zbog velikog uspeha, dobili su pozivnicu za Ozzfest 2006, sa poznatim bendovima, kao što su: DragonFors (engl. DragonForce), Disturbd (engl. Disturbed), Lakuna Koil (engl. Lacuna Coil), Hejtbrid (engl. Hatebreed)i Sistem of a Daun (engl. System of a Down).Album koji nosi naziv benda \"Avenged Sevenfold\" izašao je 30.oktobra, 2007. godine. U prvoj nedelji prodato je 94 000 kopija albuma što je bilo dovoljno za ulazak na Bilbordovu listu (4.mesto).Izdata su i dva singla \"Almost Easy\" i \"Critical Acclaim\".Singl \"Afterlife\" izašao je u januaru 2008. godine. Četvrti singl bila je pesma \"Dear God\" u kantri rok stilu.Album \"Avendžd Sevenfold\" izabran je za album godine od strane britanskog časopisa Kerrang!. "
      ]
    },
    {
      "_id": 4,
      "key": "image",
      "value": [
        "http://localhost:3000/blogs/singles/1719255746881-326527436.jpeg"
      ]
    },
    {
      "_id": 5,
      "key": "heading",
      "value": [
        "Is this a best metal band of 2000s?"
      ]
    },
    {
      "_id": 6,
      "key": "text",
      "value": [
        "Avendžd Sevenfold nastupa na Sonisphere Festival 2.avgusta 2009. Ovo je bio Revov poslendji nastup sa bendom pre njegove smrti.[2]Rezultati autopsije nisu bili usaglašeni.[3] S obzirom na tragediju koja ih je zadesila, ne bi trebalo da čudi činjenica da je i materijal bio dosta mračniji i da se na albumu našlo više sporijih, setnih pesama nego ikada pre. Bend je nastojao da kroz svaku notu albuma protka sećanje na palog brata, uključujući i činjenicu da je za bubnjevima regrutovan Majk Portnoj (Dream Theater), jedan od Rev-ovih omiljenih bubnjara koji je verodostojno odsvirao sve deonice u stilu pokojnog bubnjara. Međutim verovatno najemotivniji momenti na albumu stižu u vidu pesama „So Far Away“, srceparajućoj baladi posvećenoj Rev-ovoj smrti, i „Fiction“ , u kojoj je bend koristio Rev-ove vokalne deonice koje je ovaj snimio za života kao demo verzije. Bend se na ovom albumu odlučio za kontroverzan korak i kao producenta uposlio Mike Elizondo-a, koji je pre toga sarađivao uglavnom sa pop i hip-hop izvođačima, uključujući Alanis Morissette, Eminem-a, Dr. Dre-a, Marun 5, Fifti Cent-a i mnoge druge. Teško je bilo poverovati da će čovek koji je napisao „The Real Slim Shady“ biti u stanju da iznese silinu jednog od najpopularnijih heavy metal sastava na planeti, no i pored toga „Nightmare“ je sa produkcijske strane besprekoran, a Elizondo je nastavio da radi u okviru žanra koji nije njegov modus operandi, te je tako bio zadužen za produkciju nahvaljenog albuma „The Hunter“ benda Mastodun, objavljenog iduće godine."
      ]
    },
    {
      "_id": 7,
      "key": "image",
      "value": [
        "http://localhost:3000/blogs/singles/1719255746886-41112993.jpeg"
      ]
    }
  ],
  "published": false
},
{
  "_id": "9275ebfa-e743-4a28-8f21-e273d201d183",
  "topic_id": "f27cf95d-54c2-4771-8daf-455800601d54",
  "title": "Sjecas li se doli bel, sta znamo o ovom filmu?",
  "featuredImage": "http://localhost:3000/blogs/featured/1719255936658-184789117.jpeg",
  "content": [
    {
      "_id": 0,
      "key": "heading",
      "value": [
        "Nista, pusi ga siso"
      ]
    },
    {
      "_id": 1,
      "key": "text",
      "value": [
        "aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa"
      ]
    },
    {
      "_id": 2,
      "key": "gallery",
      "value": [
        "http://localhost:3000/blogs/galleries/1719255936673-684301799.webp",
        "http://localhost:3000/blogs/galleries/1719255936701-453203034.jpeg",
        "http://localhost:3000/blogs/galleries/1719255936722-506200203.png"
      ]
    },
    {
      "_id": 3,
      "key": "text",
      "value": [
        "WHAT THE FUCK ASDLFLKAJDS;LFKJASDLKFVASD;LKFJASDMNFVKLAJLF;A"
      ]
    },
    {
      "_id": 4,
      "key": "gallery",
      "value": [
        "http://localhost:3000/blogs/galleries/1719255936687-254506201.webp",
        "http://localhost:3000/blogs/galleries/1719255936687-245806314.webp",
        "http://localhost:3000/blogs/galleries/1719255936687-108521985.webp"
      ]
    },
    {
      "_id": 5,
      "key": "heading",
      "value": [
        "Hey man, go the fuck away."
      ]
    },
    {
      "_id": 6,
      "key": "text",
      "value": [
        "Can you suck my cock please? Thank you..."
      ]
    },
    {
      "_id": 7,
      "key": "gallery",
      "value": [
        "http://localhost:3000/blogs/galleries/1719255936689-450632612.jpeg",
        "http://localhost:3000/blogs/galleries/1719255936699-622963544.jpeg",
        "http://localhost:3000/blogs/galleries/1719255936705-901151306.jpeg"
      ]
    }
  ],
  "published": false
}]